In [43]:
import pandas as pd

In [44]:
data = pd.read_csv('C:\\Users\\DELL\\PycharmProjects\\placement\\placement\\my_app\\NoteBook\\Placement_Data_Full_Class.csv')

In [45]:
import warnings

In [46]:
warnings.filterwarnings("ignore")

In [47]:
#Display 5 rows of dataset
data.head()

,sl_no,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status,salary
0,1,67.00,Others,91.00,Others,Commerce,58.00,Commerce,No,55.0,Placed,270000.0
1,2,79.33,Central,78.33,Others,Science,77.48,Science And Technology,Yes,86.5,Placed,200000.0
2,3,65.00,Central,68.00,Central,Arts,64.00,Arts,No,75.0,Placed,250000.0
3,4,56.00,Central,52.00,Central,Science,52.00,Commerce,No,66.0,Not Placed,NaN
4,5,85.80,Central,73.60,Central,Commerce,73.30,Management,No,96.8,Placed,425000.0

In [48]:
data.tail()

,sl_no,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status,salary
210,211,80.6,Others,82.0,Others,Commerce,77.6,Commerce,No,91.0,Placed,400000.0
211,212,58.0,Others,60.0,Others,Science,72.0,Science And Technology,No,74.0,Placed,275000.0
212,213,67.0,Others,67.0,Others,Commerce,73.0,Others,Yes,59.0,Placed,295000.0
213,214,74.0,Others,66.0,Others,Commerce,58.0,Management,No,70.0,Placed,204000.0
214,215,62.0,Central,58.0,Others,Science,53.0,Commerce,No,89.0,Not Placed,NaN

In [49]:
#Shape of dataset
data.shape

(215, 12)

In [50]:
print("Number of rows",data.shape[0])
print("Number of columns",data.shape[1])

Number of rows 215
Number of columns 12

In [51]:
#Check null values
data.isnull().sum()

sl_no        0
ssc_p        0
ssc_b        0
hsc_p        0
hsc_b        0
hsc_s        0
degree_p     0
degree_t     0
workex       0
etest_p      0
status       0
salary      67
dtype: int64

In [52]:
data.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,940000.000000

In [53]:
#EDA
data.columns

Index(['sl_no', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s', 'degree_p',
       'degree_t', 'workex', 'etest_p', 'status', 'salary'],
      dtype='object')

In [54]:
data['status'].unique()

array(['Placed', 'Not Placed'], dtype=object)

In [55]:
data['status'].value_counts()

status
Placed        148
Not Placed     67
Name: count, dtype: int64

In [56]:
data.columns

Index(['sl_no', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s', 'degree_p',
       'degree_t', 'workex', 'etest_p', 'status', 'salary'],
      dtype='object')

In [57]:
data[(data['degree_t']=="Science And Technology")& (data['status']=="Placed")].sort_values(by="salary",ascending=False).head()

,sl_no,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status,salary
77,78,64.00,Others,80.00,Others,Science,65.00,Science And Technology,Yes,69.0,Placed,500000.0
174,175,73.24,Others,50.83,Others,Science,64.27,Science And Technology,Yes,64.0,Placed,500000.0
53,54,80.00,Others,70.00,Others,Science,72.00,Science And Technology,No,87.0,Placed,450000.0
39,40,81.00,Others,68.00,Others,Science,64.00,Science And Technology,No,93.0,Placed,411000.0
104,105,69.00,Central,63.00,Others,Science,65.00,Science And Technology,Yes,55.0,Placed,360000.0

In [58]:
data.head()

,sl_no,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status,salary
0,1,67.00,Others,91.00,Others,Commerce,58.00,Commerce,No,55.0,Placed,270000.0
1,2,79.33,Central,78.33,Others,Science,77.48,Science And Technology,Yes,86.5,Placed,200000.0
2,3,65.00,Central,68.00,Central,Arts,64.00,Arts,No,75.0,Placed,250000.0
3,4,56.00,Central,52.00,Central,Science,52.00,Commerce,No,66.0,Not Placed,NaN
4,5,85.80,Central,73.60,Central,Commerce,73.30,Management,No,96.8,Placed,425000.0

In [59]:
data = data.drop(['sl_no','salary'],axis=1)

In [60]:
data.head(1)

,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status
0,67.0,Others,91.0,Others,Commerce,58.0,Commerce,No,55.0,Placed

In [61]:
data['ssc_b'].unique()

array(['Others', 'Central'], dtype=object)

In [62]:
data['ssc_b'] = data['ssc_b'].map({'Central':1,'Others':0})

In [63]:
data.head(2)

,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status
0,67.00,0,91.00,Others,Commerce,58.00,Commerce,No,55.0,Placed
1,79.33,1,78.33,Others,Science,77.48,Science And Technology,Yes,86.5,Placed

In [64]:
data['hsc_b'].unique()

array(['Others', 'Central'], dtype=object)

In [65]:
data['hsc_b'] = data['hsc_b'].map({'Central':1,'Others':0})

In [66]:
data.head(2)

,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status
0,67.00,0,91.00,0,Commerce,58.00,Commerce,No,55.0,Placed
1,79.33,1,78.33,0,Science,77.48,Science And Technology,Yes,86.5,Placed

In [67]:
data['hsc_s'].unique()

array(['Commerce', 'Science', 'Arts'], dtype=object)

In [68]:
data['hsc_s'] = data['hsc_s'].map({'Science':2,'Commerce':1,'Arts':0})

In [69]:
data.head()

,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status
0,67.00,0,91.00,0,1,58.00,Commerce,No,55.0,Placed
1,79.33,1,78.33,0,2,77.48,Science And Technology,Yes,86.5,Placed
2,65.00,1,68.00,1,0,64.00,Arts,No,75.0,Placed
3,56.00,1,52.00,1,2,52.00,Commerce,No,66.0,Not Placed
4,85.80,1,73.60,1,1,73.30,Management,No,96.8,Placed

In [70]:
data['degree_t'].unique()

array(['Commerce', 'Science And Technology', 'Arts', 'Management',
       'Others'], dtype=object)

In [71]:
data['degree_t'] = data['degree_t'].map({'Commerce':4,'Science And Technology':3,'Arts':2,'Management':1,'Others':0})

In [72]:
data.head(2)

,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status
0,67.00,0,91.00,0,1,58.00,4,No,55.0,Placed
1,79.33,1,78.33,0,2,77.48,3,Yes,86.5,Placed

In [73]:
data['workex'].unique()

array(['No', 'Yes'], dtype=object)

In [74]:
data['workex'] = data['workex'].map({'Yes':1,'No':0})

In [75]:
data.head(2)

,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status
0,67.00,0,91.00,0,1,58.00,4,0,55.0,Placed
1,79.33,1,78.33,0,2,77.48,3,1,86.5,Placed

In [76]:
data['status'].unique()

array(['Placed', 'Not Placed'], dtype=object)

In [77]:
data['status'] = data['status'].map({'Placed':1,'Not Placed':0})

In [78]:
data.head()

,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,status
0,67.00,0,91.00,0,1,58.00,4,0,55.0,1
1,79.33,1,78.33,0,2,77.48,3,1,86.5,1
2,65.00,1,68.00,1,0,64.00,2,0,75.0,1
3,56.00,1,52.00,1,2,52.00,4,0,66.0,0
4,85.80,1,73.60,1,1,73.30,1,0,96.8,1

In [79]:
data.columns

Index(['ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s', 'degree_p', 'degree_t',
       'workex', 'etest_p', 'status'],
      dtype='object')

In [80]:
X = data.drop('status',axis=1)
y= data['status']

In [81]:
y

0      1
1      1
2      1
3      0
4      1
      ..
210    1
211    1
212    1
213    1
214    0
Name: status, Length: 215, dtype: int64

In [82]:
from sklearn.model_selection import train_test_split

In [83]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.20,random_state=42)

In [84]:
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn import svm
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import GradientBoostingClassifier

In [85]:
lr = LogisticRegression()
lr.fit(X_train,y_train)

svm = svm.SVC()
svm.fit(X_train,y_train)

knn=KNeighborsClassifier()
knn.fit(X_train,y_train)

dt=DecisionTreeClassifier()
dt.fit(X_train,y_train)

rf=RandomForestClassifier()
rf.fit(X_train,y_train)

gb=GradientBoostingClassifier()
gb.fit(X_train,y_train)

GradientBoostingClassifier()

In [86]:
y_pred1 = lr.predict(X_test)
y_pred2 = svm.predict(X_test)
y_pred3 = knn.predict(X_test)
y_pred4 = dt.predict(X_test)
y_pred5 = rf.predict(X_test)
y_pred6 = gb.predict(X_test)

In [87]:
from sklearn.metrics import accuracy_score

In [88]:
score1=accuracy_score(y_test,y_pred1)
score2=accuracy_score(y_test,y_pred2)
score3=accuracy_score(y_test,y_pred3)
score4=accuracy_score(y_test,y_pred4)
score5=accuracy_score(y_test,y_pred5)
score6=accuracy_score(y_test,y_pred6)

In [89]:
print(score1,score2,score3,score4,score5,score6)

0.7441860465116279 0.7441860465116279 0.8372093023255814 0.7674418604651163 0.7441860465116279 0.7906976744186046

In [90]:
final_data = pd.DataFrame({'Models':['LR','SVC','KNN','DT','RF','GB'],
            'ACC':[score1*100,
                  score2*100,
                  score3*100,
                  score4*100,
                  score5*100,score6*100]})

In [91]:
final_data

  Models        ACC
0     LR  74.418605
1    SVC  74.418605
2    KNN  83.720930
3     DT  76.744186
4     RF  74.418605
5     GB  79.069767

In [92]:
#Predicting
new_data = pd.DataFrame({
    'ssc_p':67.0,
    'ssc_b':0,
    'hsc_p':91.0,
    'hsc_b':0,
    'hsc_s':1,
    'degree_p':58.0,
    'degree_t':2,
    'workex':0,
    'etest_p':55.0,
},index=[0])

In [93]:
lr= LogisticRegression()
lr.fit(X,y)

LogisticRegression()

In [94]:
p=lr.predict(new_data)
prob=lr.predict_proba(new_data)
if p==1:
    print('Placed')
    print(f"You will be placed with probability of {prob[0][1]:.2f}")
else:
    print("Not-placed")

Placed
You will be placed with probability of 0.97

In [95]:
prob

array([[0.03298666, 0.96701334]])

In [96]:
import joblib

In [97]:
joblib.dump(lr,'model_campus_placement')

['model_campus_placement']

In [98]:
model = joblib.load('model_campus_placement')

In [99]:
model.predict(new_data)

array([1], dtype=int64)